ХамелионЦРПТ/src/InformationRegisters/МВ_СоотвествиеФайловВводуВОборот/МВ_СоотвествиеФайловВводуВОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВ_СоотвествиеФайловВводуВОборот</name>
  <resources>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>GTIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/МВ_СоотвествиеФайловВводуВОборот/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.GTIN = ""
			ИЛИ Запись.НомерПартии = ""
			ИЛИ Запись.ДатаПроизводства = "" Тогда
			Продолжить;	
		КонецЕсли; 
		
		МассивИсключений = Новый Массив;
		МассивИсключений.Добавить(Запись.ВводВОборот);

		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("GTIN",Запись.GTIN );
		СтруктураДанных.Вставить("НомерПартии",Запись.НомерПартии );
		СтруктураДанных.Вставить("ДатаПроизводства",Запись.ДатаПроизводства );

		
		ВводВОборот = РегистрыСведений.МВ_СоотвествиеФайловВводуВОборот.ВводВОборотПоДаннымФайла(СтруктураДанных, МассивИсключений);
		
		Если ВводВОборот.Количество() Тогда

			ЕстьПроведенный = Ложь;
			Для Каждого ТО из ВводВОборот Цикл
				Если ТО.Проведен Тогда
					ЕстьПроведенный = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю( СтрШаблон(нСтр("ru='Для GTIN: 1% НомерПартии: 2% ДатаВыработки от 3% существует ввод в оборот 4%'", "ru"), Запись.GTIN,Запись.НомерПартии,Запись.ДатаПроизводства,ВводВОборот[0])) ;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
